Tasks/ЗадачиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Task>
		<Properties>
			<Name>ЗадачиПользователя</Name>
			<Comment>Общие рабочие поручения и персональные задания</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПеремещениеНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.МИКО_стЗаписьИсторииЗвонков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваровНаСкладе</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыХарактеристик</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровВРознице</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПамятнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоФакту</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолВоТоваровНаСкладеРозы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ЗадачиПользователя/Ext/ManagerModule.bsl
// Задача "Новые платежи Приват24" закрывается в момент открытия: менеджер,
// открыв её, сразу идёт принимать платёж, и повторно она уже не всплывает
// (см. БанковскиеВыписки.ВыполнитьЗадачуНовыхПлатежейПриОткрытии).
//
// Этот обработчик - страховка на случай, если платформа вызывает
// ОбработкаПолученияФормы и для обычных форм. Основной, гарантированный путь -
// вызов из ПриОткрытии() формы Задача.ЗадачиПользователя.ФормаЗадачи
// (форма двоичная, строка ставится в Конфигураторе).
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Попытка

		Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
			Возврат;
		КонецЕсли;

		КлючЗадачи = Неопределено;

		Если Не Параметры.Свойство("Ключ", КлючЗадачи) Тогда
			Возврат;
		КонецЕсли;

		Если ТипЗнч(КлючЗадачи) <> Тип("ЗадачаСсылка.ЗадачиПользователя")
			Или Не ЗначениеЗаполнено(КлючЗадачи) Тогда

			Возврат;

		КонецЕсли;

		Если Не БанковскиеВыписки.ЭтоЗадачаНовыхПлатежей(КлючЗадачи) Тогда
			Возврат;
		КонецЕсли;

		БанковскиеВыписки.ВыполнитьЗадачуНовыхПлатежейПриОткрытии(
			КлючЗадачи.ПолучитьОбъект());

	Исключение

		// Открытие формы не срываем ни при каких условиях.

	КонецПопытки;

КонецПроцедуры

Функция Создать(ИдентификаторСобытия, Наименование, Основание = неопределено) Экспорт

    ИсполнительГруппа = Справочники.Пользователи.НайтиПоНаименованию("Малюта Виталик").Родитель;

    Запрос = Новый Запрос;

    Запрос.Текст = "ВЫБРАТЬ
                    | ЗадачиПользователя.Ссылка КАК Ссылка
                    |ИЗ
                    | Задача.ЗадачиПользователя КАК ЗадачиПользователя
                    |ГДЕ
                    | ЗадачиПользователя.ИдентификаторСобытия = &ИдентификаторСобытия
                    | И ЗадачиПользователя.Выполнена = ЛОЖЬ";

    Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);

    Выборка = Запрос.Выполнить().Выбрать();

    // Проверка на наличие более одной записи
    КоличествоЗаписей = 0;
    Пока Выборка.Следующий() Цикл
        КоличествоЗаписей = КоличествоЗаписей + 1;
        Если КоличествоЗаписей > 1 Тогда
            Возврат неопределено;
        КонецЕсли;
        СуществующаяЗадача = Выборка.Ссылка;
    КонецЦикла;

    Если КоличествоЗаписей = 1 Тогда
        Задача = СуществующаяЗадача.ПолучитьОбъект();
    Иначе
        Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
    КонецЕсли;

    Задача.ИдентификаторСобытия = ИдентификаторСобытия;
    Задача.Наименование = Наименование;
    Задача.Исполнитель = ИсполнительГруппа;
    Задача.Дата = НачалоДня(ТекущаяДата()) + 32400;
    Задача.Оповещение = Истина;
    Задача.Описание = "https://cvetkovtm.com/assets/shop/sync/Etsy.xlsx";
    Задача.СрокОповещения = Задача.Дата;
    Задача.СрокИсполнения = НачалоДня(ТекущаяДата()) + 32400;
    Задача.Объект = Основание; 

    Попытка
        Задача.Записать();
    Исключение
        // Обработка исключения, если необходимо
    КонецПопытки;

    Возврат Задача;
КонецФункции
